performance-test-reports/next-updates/12533174691/1/user-registration/user_registration/run.log
-    █ [Create Account Service]

-      █ should be able to register new user successfully

-        ✓ is status 200
-        ✓ response body
-        ✓ expected status to equal 200
-        ✓ expected user registration api response to equal 'User Registered'

-    checks.........................: 100.00% ✓ 2400     ✗ 0    
-    data_received..................: 115 kB  1.9 kB/s
-    data_sent......................: 169 kB  2.8 kB/s
-    group_duration.................: avg=10.19ms  min=3.38ms   med=4.13ms   max=711.55ms p(90)=4.89ms   p(95)=5.47ms  
-    http_req_blocked...............: avg=192.64µs min=137.03µs med=182.99µs max=736.26µs p(90)=243.46µs p(95)=268.62µs
-    http_req_connecting............: avg=139.59µs min=95.45µs  med=129.42µs max=507.27µs p(90)=182.66µs p(95)=197.91µs
-  ✓ http_req_duration..............: avg=9.09ms   min=2.41ms   med=3.04ms   max=710.24ms p(90)=3.73ms   p(95)=4.32ms  
-      { expected_response:true }...: avg=9.09ms   min=2.41ms   med=3.04ms   max=710.24ms p(90)=3.73ms   p(95)=4.32ms  
-  ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 600  
-    http_req_receiving.............: avg=70.86µs  min=38.47µs  med=71.2µs   max=496.14µs p(90)=92.99µs  p(95)=98.87µs 
-    http_req_sending...............: avg=41.65µs  min=17.19µs  med=37.99µs  max=337.87µs p(90)=54.47µs  p(95)=59.95µs 
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=8.98ms   min=2.27ms   med=2.93ms   max=710.13ms p(90)=3.62ms   p(95)=4.22ms  
-    http_reqs......................: 600     9.998045/s
-    iteration_duration.............: avg=10.24ms  min=3.44ms   med=4.18ms   max=711.59ms p(90)=4.95ms   p(95)=5.51ms  
-    iterations.....................: 600     9.998045/s
-    vus............................: 0       min=0      max=0  
-    vus_max........................: 200     min=200    max=200